tasks/04-conf/src/Configuration/Reports/Перерасчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Report>
		<Properties>
			<Name>Перерасчет</Name>
		</Properties>
	</Report>
</MetaDataObject>

tasks/04-conf/src/Configuration/CalculationRegisters/ДополнительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<CalculationRegister>
		<Properties>
			<Name>ДополнительныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтавкаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

tasks/04-conf/src/Configuration/Reports/Перерасчет/Forms/ФормаОтчета/Ext/Form/Module.bsl
// ===== СЕРВЕРНАЯ ПРОЦЕДУРА ПЕРЕРАСЧЕТА (БЕЗ КОНТЕКСТА ВЫПОЛНЕНИЯ) =====
// Процедура вызывается на сервере без контекста для массового перерасчета
// дополнительных начислений по данным из регистра перерасчетов
&НаСервереБезКонтекста
Процедура ПерерассчитатьНаСервере()
	
	// ===== ПОЛУЧЕНИЕ ДАННЫХ ДЛЯ ПЕРЕРАСЧЕТА =====
	// Запрос собирает все записи из регистра перерасчетов,
	// сгруппированные по документу-регистратору (чтобы пересчитывать документы целиком)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Перерасчет.ОбъектПерерасчета КАК Регистратор,
		|	Перерасчет.Сотрудник КАК Сотрудник,
		|	Перерасчет.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисления.Перерасчет КАК Перерасчет
		|ИТОГИ ПО
		|	Регистратор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// ===== ОБРАБОТКА СГРУППИРОВАННЫХ ДАННЫХ =====
	// Группировка позволяет пересчитывать один документ за один раз,
	// что эффективнее, чем построчный перерасчет
	ВыборкаРегистратор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Создаем таблицу для передачи фильтра в расчетную функцию
	// Фильтр содержит конкретных сотрудников и подразделения для каждого документа
	ДопОтбор = Новый ТаблицаЗначений;
	ДопОтбор.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ДопОтбор.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	
	// ===== ПЕРЕРАСЧЕТ КАЖДОГО ДОКУМЕНТА ОТДЕЛЬНО =====
	// Для каждого документа, требующего перерасчета:
	// 1. Формируем фильтр по сотрудникам и подразделениям
	// 2. Загружаем существующие записи
	// 3. Вызываем перерасчет только для нужных записей
	Пока ВыборкаРегистратор.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаРегистратор.Выбрать();
		
		 // Очищаем таблицу фильтра для нового документа
		ДопОтбор.Очистить();
		
		 // Заполняем фильтр конкретными строками, требующими перерасчета
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = ДопОтбор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		КонецЦикла;
		
		// Создаем набор записей для конкретного документа
        	// и загружаем текущие данные из регистра расчета
		НаборЗаписей = РегистрыРасчета.ДополнительныеНачисления.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
		НаборЗаписей.Прочитать();
		
		// Вызываем расчетную функцию только для измененных записей
        	// ДопОтбор ограничивает перерасчет только нужными сотрудниками и подразделениями
		ЗаписьРасчетов.ЗаписатьДополнительныеНачисления(НаборЗаписей, ВыборкаРегистратор.Регистратор, ДопОтбор);
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура Перерассчитать(Команда)
	 // 1. Выполняем перерасчет на сервере
	ПерерассчитатьНаСервере(); 
	// 2. Обновляем данные отчета, чтобы показать актуальные результаты
	СкомпоноватьРезультат();
КонецПроцедуры
